# EXERCISE

In [17]:
import pandas as pd
import numpy as np
import os

In [18]:
df_test = pd.DataFrame()
df_test['mix'] = ['a', 'b', 1, True]

In [19]:
# check for mixed type columns
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [20]:
df_test['mix'] = df_test['mix'].astype('str')

In [21]:
# define the path and assign dataframes to the "df" variables
path = r'C:\Users\Jakov\2023 Instacart Basket Analysis'
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)
df_ords_wrangled = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = 0)

In [22]:
df_ords_wrangled.shape

(3421083, 6)

In [23]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [7]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [8]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [9]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False] # create the new subset without NA valuesdfd

In [10]:
df_dups = df_prods_clean[df_prods_clean.duplicated()] # create the new subset of duplicated rows

In [11]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [12]:
df_prods_clean.shape

(49677, 5)

In [13]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [14]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [15]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# TASK

# 01.

In [37]:
df_ords_wrangled.describe()

,order_id,user_id,order_number,orders_day_of_a_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [10]:
df_ords_wrangled.shape

(3421083, 6)

# Everything looks good here.

# 02. ANSWER - There is no mixed type data column.

In [38]:
# check for mixed type columns
for col in df_ords_wrangled.columns.tolist():
  weird = (df_ords_wrangled[[col]].applymap(type) != df_ords_wrangled[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords_wrangled[weird]) > 0:
    print (col)

# 05.

In [39]:
df_ords_wrangled.isnull().sum() # show a frequency of missing values for each column

order_id                       0
user_id                        0
order_number                   0
orders_day_of_a_week           0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [40]:
df_ords_wrangled.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_a_week    int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(5)
memory usage: 182.7 MB

In [43]:
# create the new subset with NA values only
df_ords_na = df_ords_wrangled[df_ords_wrangled['days_since_prior_order'].isnull() == True]

In [46]:
df_ords_na

,order_id,user_id,order_number,orders_day_of_a_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [51]:
# generate array of all unique values of the 'user_id' column
df_ords_wrangled['user_id'].unique()

array([     1,      2,      3, ..., 206207, 206208, 206209], dtype=int64)

# Count of missing values matches the count of unique users. Which means that orders with missing values are actually the first orders ever made by users.

# 06. Answer - Since the rows with missing values still contain useful data, I suggest to create new boolean type column which acts as a flag based on whether was that order first ever placed by an user or not.

In [52]:
# create new boolean type column which acts as a flag flag based on whether was that order first ever placed by an user or not
df_ords_wrangled['first_order_ever'] = np.where(df_ords_wrangled['days_since_prior_order'].isnull(), True, False)

In [56]:
# check if the new column is inserted correctly
df_ords_wrangled[df_ords_wrangled['days_since_prior_order'].isnull() == False]

,order_id,user_id,order_number,orders_day_of_a_week,order_hour_of_day,days_since_prior_order,first_order_ever
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
5,3367565,1,6,2,7,19.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

# 07. Answer - The orders dataset does not contain any duplicate values.

In [57]:
# create the new dataframe with only duplicated values from 'df_ords_wrangled' dataframe
df_ords_dups = df_ords_wrangled[df_ords_wrangled.duplicated()]

In [58]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_a_week, order_hour_of_day, days_since_prior_order, first_order_ever]
Index: []

# 09.

In [60]:
df_ords_wrangled.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [11]:
df_ords_wrangled.shape

(3421083, 6)